# Задача 16: Требуется вычислить, сколько раз встречается некоторое число X в массиве A[1..N].
# Пользователь в первой строке вводит натуральное число N – количество элементов в массиве.
# В последующих  строках записаны N целых чисел Ai. Последняя строка содержит число X

# *Пример:*

# 5
#     1 2 3 4 5
#     3
#     -> 1

# Создание списка чисел
from random import randint
list = []
listLength = int(input("Введите размер массива (кол-во элементов)  "))

for i in range(listLength):
    list.append(randint(-3, 3))
print()
print(list)
print()

# Поиск числа в массиве
number = int(input("Введите число, которое нужно найти в массиве  "))
count = 0

for i in range(listLength):
    if list[i] == number:
        count += 1
print(f"Заданное число {number} встречается в массиве {count} раз")
